---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoSurfPatternOnRebar
source: html/159039a4-4dc9-91f8-0b3b-2c90a4c8dfdf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoSurfPatternOnRebar Property

Rebar elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Rebar Type.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSurfPatternOnRebar { get; }
```